usr.sbin/geom-events/geom-events.8
.\"
.\" Copyright (c) 2011 Lev Serebryakov <lev@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd September 12, 2011
.Dt GEOM-EVENTS 8
.Os
.Sh NAME
.Nm geom-events
.Nd command for processing
.Xr geom 4
events passed to
.Xr devd 8 .
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
The
.Nm
utility is a shell script.
.Sh CONFIGURATION
The
.Nm
utility reads its configuration information from
.Pa /etc/geom-events.conf .
If this file does not exist, it will use predefined defaults.
.Sh FILES
.Sh SEE ALSO
.Xr geom-events 8 ,
.Xr devd 8 ,
.Xr geom 8 ,
.Xr geom 4
.Sh HISTORY
The
.Nm
utility and manual page first appeared in
.Fx 9.0 .
.Sh AUTHORS
This utility and manual page was written by
.An Lev Serebryakov Aq lev@FreeBSD.org .
